remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
/**
 * \file
 *
 * \brief Component description for SPI
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_SPI_COMPONENT_
#define _SAMB11_SPI_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SPI */
/* ========================================================================== */
/** \addtogroup SAMB11_SPI SPI Master/Slave Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define SPI_S1234
#define REV_SPI                          0x100

/* -------- SPI_TRANSMIT_DATA : (SPI Offset: 0x00) (/W 8) Writes one byte to SPI Transmit Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_BYTE:8;                 /**< bit:   0..7  Writes data in transmit FIFO.            */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_TRANSMIT_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TRANSMIT_DATA_OFFSET            0x00                                          /**<  (SPI_TRANSMIT_DATA) Writes one byte to SPI Transmit Data FIFO.   Offset */
#define SPI_TRANSMIT_DATA_RESETVALUE        0x00u                                         /**<  (SPI_TRANSMIT_DATA) Writes one byte to SPI Transmit Data FIFO.   Reset Value */

#define SPI_TRANSMIT_DATA_TX_BYTE_Pos       0                                              /**< (SPI_TRANSMIT_DATA) Writes data in transmit FIFO.  Position */
#define SPI_TRANSMIT_DATA_TX_BYTE_Msk       (0xFFu << SPI_TRANSMIT_DATA_TX_BYTE_Pos)       /**< (SPI_TRANSMIT_DATA) Writes data in transmit FIFO.  Mask */
#define SPI_TRANSMIT_DATA_TX_BYTE(value)    (SPI_TRANSMIT_DATA_TX_BYTE_Msk & ((value) << SPI_TRANSMIT_DATA_TX_BYTE_Pos))
#define SPI_TRANSMIT_DATA_MASK              0xFFu                                          /**< \deprecated (SPI_TRANSMIT_DATA) Register MASK  (Use SPI_TRANSMIT_DATA_Msk instead)  */
#define SPI_TRANSMIT_DATA_Msk               0xFFu                                          /**< (SPI_TRANSMIT_DATA) Register Mask  */

/* -------- SPI_RECEIVE_DATA : (SPI Offset: 0x04) (R/ 8) Read one byte from SPI Receive Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_BYTE:8;                 /**< bit:   0..7  Oldest data in receive FIFO.             */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_RECEIVE_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RECEIVE_DATA_OFFSET             0x04                                          /**<  (SPI_RECEIVE_DATA) Read one byte from SPI Receive Data FIFO.   Offset */
#define SPI_RECEIVE_DATA_RESETVALUE         0x00u                                         /**<  (SPI_RECEIVE_DATA) Read one byte from SPI Receive Data FIFO.   Reset Value */

#define SPI_RECEIVE_DATA_RX_BYTE_Pos        0                                              /**< (SPI_RECEIVE_DATA) Oldest data in receive FIFO.  Position */
#define SPI_RECEIVE_DATA_RX_BYTE_Msk        (0xFFu << SPI_RECEIVE_DATA_RX_BYTE_Pos)        /**< (SPI_RECEIVE_DATA) Oldest data in receive FIFO.  Mask */
#define SPI_RECEIVE_DATA_RX_BYTE(value)     (SPI_RECEIVE_DATA_RX_BYTE_Msk & ((value) << SPI_RECEIVE_DATA_RX_BYTE_Pos))
#define SPI_RECEIVE_DATA_MASK               0xFFu                                          /**< \deprecated (SPI_RECEIVE_DATA) Register MASK  (Use SPI_RECEIVE_DATA_Msk instead)  */
#define SPI_RECEIVE_DATA_Msk                0xFFu                                          /**< (SPI_RECEIVE_DATA) Register Mask  */

/* -------- SPI_TRANSMIT_STATUS : (SPI Offset: 0x08) (R/ 8) Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL:1;        /**< bit:      0  Active High indication when Tx FIFO can still accepts at least one more character. */
    uint8_t  TX_FIFO_0P25_EMPTY:1;      /**< bit:      1  Active High indication when Tx FIFO is at least quarter empty. Reset when more.  */
    uint8_t  TX_FIFO_0P5_EMPTY:1;       /**< bit:      2  Active High indication when Tx FIFO is at least half empty. Reset when more.  */
    uint8_t  TX_FIFO_0P75_EMPTY:1;      /**< bit:      3  Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  */
    uint8_t  TX_FIFO_EMPTY:1;           /**< bit:      4  Active High indication when Tx FIFO is Empty and has no more character to transmit  */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_TRANSMIT_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TRANSMIT_STATUS_OFFSET          0x08                                          /**<  (SPI_TRANSMIT_STATUS) Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Offset */
#define SPI_TRANSMIT_STATUS_RESETVALUE      0x00u                                         /**<  (SPI_TRANSMIT_STATUS) Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Reset Value */

