remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
#define SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos 0                                              /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. Position */
#define SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk (0x1u << SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. Mask */
#define SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk instead */
#define   SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0_Val 0x0u                                           /**< (SPI_TRANSMIT_STATUS) TX FIFO Full  */
#define   SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1_Val 0x1u                                           /**< (SPI_TRANSMIT_STATUS) TX FIFO not Full  */
#define SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0 (SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0_Val << SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (SPI_TRANSMIT_STATUS) TX FIFO Full Position  */
#define SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1 (SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1_Val << SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (SPI_TRANSMIT_STATUS) TX FIFO not Full Position  */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos 1                                              /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Position */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk (0x1u << SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos)  /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Mask */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk instead */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos 2                                              /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Position */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk (0x1u << SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos)  /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Mask */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk instead */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos 3                                              /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Position */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk (0x1u << SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos)  /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Mask */
#define SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk instead */
#define SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos 4                                              /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Position */
#define SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk (0x1u << SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos)  /**< (SPI_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Mask */
#define SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY   SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk instead */
#define SPI_TRANSMIT_STATUS_MASK            0x1Fu                                          /**< \deprecated (SPI_TRANSMIT_STATUS) Register MASK  (Use SPI_TRANSMIT_STATUS_Msk instead)  */
#define SPI_TRANSMIT_STATUS_Msk             0x1Fu                                          /**< (SPI_TRANSMIT_STATUS) Register Mask  */

/* -------- SPI_RECEIVE_STATUS : (SPI Offset: 0x0c) (R/ 8) Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY:1;       /**< bit:      0  Active High indication when data is available in Rx FIFO */
    uint8_t  RX_FIFO_0P25_FULL:1;       /**< bit:      1  Active High indication when FIFO is at least quarter full. Reset when less.  */
    uint8_t  RX_FIFO_0P5_FULL:1;        /**< bit:      2  Active High indication when FIFO is at least half full. Reset when less.  */
    uint8_t  RX_FIFO_0P75_FULL:1;       /**< bit:      3  Active High indication when FIFO is at least three quarters full. Reset when less.  */
    uint8_t  FAULT:1;                   /**< bit:      4  Active High indication when two masters attempt to access the SPI bus at the same time. The SPI interface will put itself in slave mode in this case. This bit is reset when the status register is read.   */
    uint8_t  FIFO_OVERRUN:1;            /**< bit:      5  Active High indication when character is received but FIFO is full. Reset by reading  the status register.  */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_RECEIVE_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RECEIVE_STATUS_OFFSET           0x0C                                          /**<  (SPI_RECEIVE_STATUS) Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Offset */
#define SPI_RECEIVE_STATUS_RESETVALUE       0x00u                                         /**<  (SPI_RECEIVE_STATUS) Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Reset Value */

#define SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos 0                                              /**< (SPI_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO Position */
#define SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk (0x1u << SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos)  /**< (SPI_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO Mask */
#define SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk instead */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos 1                                              /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Position */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk (0x1u << SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos)  /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Mask */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk instead */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos 2                                              /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Position */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk (0x1u << SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos)  /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Mask */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk instead */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos 3                                              /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Position */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk (0x1u << SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos)  /**< (SPI_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Mask */
#define SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk instead */
#define SPI_RECEIVE_STATUS_FAULT_Pos        4                                              /**< (SPI_RECEIVE_STATUS) Active High indication when two masters attempt to access the SPI bus at the same time. The SPI interface will put itself in slave mode in this case. This bit is reset when the status register is read.   Position */
#define SPI_RECEIVE_STATUS_FAULT_Msk        (0x1u << SPI_RECEIVE_STATUS_FAULT_Pos)         /**< (SPI_RECEIVE_STATUS) Active High indication when two masters attempt to access the SPI bus at the same time. The SPI interface will put itself in slave mode in this case. This bit is reset when the status register is read.   Mask */
#define SPI_RECEIVE_STATUS_FAULT            SPI_RECEIVE_STATUS_FAULT_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_FAULT_Msk instead */
#define SPI_RECEIVE_STATUS_FIFO_OVERRUN_Pos 5                                              /**< (SPI_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading  the status register.  Position */
#define SPI_RECEIVE_STATUS_FIFO_OVERRUN_Msk (0x1u << SPI_RECEIVE_STATUS_FIFO_OVERRUN_Pos)  /**< (SPI_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading  the status register.  Mask */
#define SPI_RECEIVE_STATUS_FIFO_OVERRUN     SPI_RECEIVE_STATUS_FIFO_OVERRUN_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RECEIVE_STATUS_FIFO_OVERRUN_Msk instead */
#define SPI_RECEIVE_STATUS_MASK             0x3Fu                                          /**< \deprecated (SPI_RECEIVE_STATUS) Register MASK  (Use SPI_RECEIVE_STATUS_Msk instead)  */
#define SPI_RECEIVE_STATUS_Msk              0x3Fu                                          /**< (SPI_RECEIVE_STATUS) Register Mask  */

