remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
/* -------- SPI_CLOCK_SOURCE_SELECT : (SPI Offset: 0x10) (R/W 8) Clock Source Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CLOCK:2;                   /**< bit:   0..1  Clock Used to Generate Divided Clock     */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_CLOCK_SOURCE_SELECT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_CLOCK_SOURCE_SELECT_OFFSET      0x10                                          /**<  (SPI_CLOCK_SOURCE_SELECT) Clock Source Select  Offset */
#define SPI_CLOCK_SOURCE_SELECT_RESETVALUE  0x00u                                         /**<  (SPI_CLOCK_SOURCE_SELECT) Clock Source Select  Reset Value */

#define SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos   0                                              /**< (SPI_CLOCK_SOURCE_SELECT) Clock Used to Generate Divided Clock Position */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK_Msk   (0x3u << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos)    /**< (SPI_CLOCK_SOURCE_SELECT) Clock Used to Generate Divided Clock Mask */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK(value) (SPI_CLOCK_SOURCE_SELECT_CLOCK_Msk & ((value) << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos))
#define   SPI_CLOCK_SOURCE_SELECT_CLOCK_0_Val 0x0u                                           /**< (SPI_CLOCK_SOURCE_SELECT) 26 MHz Clock  */
#define   SPI_CLOCK_SOURCE_SELECT_CLOCK_1_Val 0x1u                                           /**< (SPI_CLOCK_SOURCE_SELECT) 13 MHz Clock  */
#define   SPI_CLOCK_SOURCE_SELECT_CLOCK_2_Val 0x2u                                           /**< (SPI_CLOCK_SOURCE_SELECT) 6.5 MHz Clock  */
#define   SPI_CLOCK_SOURCE_SELECT_CLOCK_3_Val 0x3u                                           /**< (SPI_CLOCK_SOURCE_SELECT) 3.25 MHz Clock  */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK_0     (SPI_CLOCK_SOURCE_SELECT_CLOCK_0_Val << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (SPI_CLOCK_SOURCE_SELECT) 26 MHz Clock Position  */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK_1     (SPI_CLOCK_SOURCE_SELECT_CLOCK_1_Val << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (SPI_CLOCK_SOURCE_SELECT) 13 MHz Clock Position  */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK_2     (SPI_CLOCK_SOURCE_SELECT_CLOCK_2_Val << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (SPI_CLOCK_SOURCE_SELECT) 6.5 MHz Clock Position  */
#define SPI_CLOCK_SOURCE_SELECT_CLOCK_3     (SPI_CLOCK_SOURCE_SELECT_CLOCK_3_Val << SPI_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (SPI_CLOCK_SOURCE_SELECT) 3.25 MHz Clock Position  */
#define SPI_CLOCK_SOURCE_SELECT_MASK        0x03u                                          /**< \deprecated (SPI_CLOCK_SOURCE_SELECT) Register MASK  (Use SPI_CLOCK_SOURCE_SELECT_Msk instead)  */
#define SPI_CLOCK_SOURCE_SELECT_Msk         0x03u                                          /**< (SPI_CLOCK_SOURCE_SELECT) Register Mask  */

/* -------- SPI_CLK_DIVIDER : (SPI Offset: 0x14) (R/W 16) Register sets the divide ratio used to generate the sck clock from the module's input clock.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SPI_DIVIDE_RATIO:16;       /**< bit:  0..15  Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} SPI_CLK_DIVIDER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_CLK_DIVIDER_OFFSET              0x14                                          /**<  (SPI_CLK_DIVIDER) Register sets the divide ratio used to generate the sck clock from the module's input clock.   Offset */
#define SPI_CLK_DIVIDER_RESETVALUE          0x00u                                         /**<  (SPI_CLK_DIVIDER) Register sets the divide ratio used to generate the sck clock from the module's input clock.   Reset Value */

#define SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO_Pos 0                                              /**< (SPI_CLK_DIVIDER) Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  Position */
#define SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO_Msk (0xFFFFu << SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO_Pos)  /**< (SPI_CLK_DIVIDER) Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  Mask */
#define SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO(value) (SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO_Msk & ((value) << SPI_CLK_DIVIDER_SPI_DIVIDE_RATIO_Pos))
#define SPI_CLK_DIVIDER_MASK                0xFFFFu                                        /**< \deprecated (SPI_CLK_DIVIDER) Register MASK  (Use SPI_CLK_DIVIDER_Msk instead)  */
#define SPI_CLK_DIVIDER_Msk                 0xFFFFu                                        /**< (SPI_CLK_DIVIDER) Register Mask  */

/* -------- SPI_MODULE_ENABLE : (SPI Offset: 0x18) (R/W 8) SPI Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enables SPI operation                    */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_MODULE_ENABLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_MODULE_ENABLE_OFFSET            0x18                                          /**<  (SPI_MODULE_ENABLE) SPI Enable  Offset */
#define SPI_MODULE_ENABLE_RESETVALUE        0x00u                                         /**<  (SPI_MODULE_ENABLE) SPI Enable  Reset Value */

#define SPI_MODULE_ENABLE_ENABLE_Pos        0                                              /**< (SPI_MODULE_ENABLE) Enables SPI operation Position */
#define SPI_MODULE_ENABLE_ENABLE_Msk        (0x1u << SPI_MODULE_ENABLE_ENABLE_Pos)         /**< (SPI_MODULE_ENABLE) Enables SPI operation Mask */
#define SPI_MODULE_ENABLE_ENABLE            SPI_MODULE_ENABLE_ENABLE_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_MODULE_ENABLE_ENABLE_Msk instead */
#define SPI_MODULE_ENABLE_MASK              0x01u                                          /**< \deprecated (SPI_MODULE_ENABLE) Register MASK  (Use SPI_MODULE_ENABLE_Msk instead)  */
#define SPI_MODULE_ENABLE_Msk               0x01u                                          /**< (SPI_MODULE_ENABLE) Register Mask  */

/* -------- SPI_MASTER_MODE : (SPI Offset: 0x1c) (R/W 8) SPI Master/Slave Mode. When clear, SPI is in Slave Mode.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MASTER_ENABLE:1;           /**< bit:      0  Active High SPI Master Mode Enable       */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_MASTER_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_MASTER_MODE_OFFSET              0x1C                                          /**<  (SPI_MASTER_MODE) SPI Master/Slave Mode. When clear, SPI is in Slave Mode.   Offset */
#define SPI_MASTER_MODE_RESETVALUE          0x00u                                         /**<  (SPI_MASTER_MODE) SPI Master/Slave Mode. When clear, SPI is in Slave Mode.   Reset Value */

#define SPI_MASTER_MODE_MASTER_ENABLE_Pos   0                                              /**< (SPI_MASTER_MODE) Active High SPI Master Mode Enable Position */
#define SPI_MASTER_MODE_MASTER_ENABLE_Msk   (0x1u << SPI_MASTER_MODE_MASTER_ENABLE_Pos)    /**< (SPI_MASTER_MODE) Active High SPI Master Mode Enable Mask */
#define SPI_MASTER_MODE_MASTER_ENABLE       SPI_MASTER_MODE_MASTER_ENABLE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_MASTER_MODE_MASTER_ENABLE_Msk instead */
#define   SPI_MASTER_MODE_MASTER_ENABLE_0_Val 0x0u                                           /**< (SPI_MASTER_MODE) SPI Slave  */
#define   SPI_MASTER_MODE_MASTER_ENABLE_1_Val 0x1u                                           /**< (SPI_MASTER_MODE) SPI Master  */
#define SPI_MASTER_MODE_MASTER_ENABLE_0     (SPI_MASTER_MODE_MASTER_ENABLE_0_Val << SPI_MASTER_MODE_MASTER_ENABLE_Pos)  /**< (SPI_MASTER_MODE) SPI Slave Position  */
#define SPI_MASTER_MODE_MASTER_ENABLE_1     (SPI_MASTER_MODE_MASTER_ENABLE_1_Val << SPI_MASTER_MODE_MASTER_ENABLE_Pos)  /**< (SPI_MASTER_MODE) SPI Master Position  */
#define SPI_MASTER_MODE_MASK                0x01u                                          /**< \deprecated (SPI_MASTER_MODE) Register MASK  (Use SPI_MASTER_MODE_Msk instead)  */
#define SPI_MASTER_MODE_Msk                 0x01u                                          /**< (SPI_MASTER_MODE) Register Mask  */

/* -------- SPI_FAULT_ENABLE : (SPI Offset: 0x20) (R/W 8) SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.   -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  FAULT_ENABLE:1;            /**< bit:      0  Active High SPI Fault Detect Enable      */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_FAULT_ENABLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

