remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
#define SPI_FAULT_ENABLE_OFFSET             0x20                                          /**<  (SPI_FAULT_ENABLE) SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.    Offset */
#define SPI_FAULT_ENABLE_RESETVALUE         0x00u                                         /**<  (SPI_FAULT_ENABLE) SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.    Reset Value */

#define SPI_FAULT_ENABLE_FAULT_ENABLE_Pos   0                                              /**< (SPI_FAULT_ENABLE) Active High SPI Fault Detect Enable Position */
#define SPI_FAULT_ENABLE_FAULT_ENABLE_Msk   (0x1u << SPI_FAULT_ENABLE_FAULT_ENABLE_Pos)    /**< (SPI_FAULT_ENABLE) Active High SPI Fault Detect Enable Mask */
#define SPI_FAULT_ENABLE_FAULT_ENABLE       SPI_FAULT_ENABLE_FAULT_ENABLE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FAULT_ENABLE_FAULT_ENABLE_Msk instead */
#define   SPI_FAULT_ENABLE_FAULT_ENABLE_0_Val 0x0u                                           /**< (SPI_FAULT_ENABLE) Faults ignored on SPI bus  */
#define   SPI_FAULT_ENABLE_FAULT_ENABLE_1_Val 0x1u                                           /**< (SPI_FAULT_ENABLE) Faults detected on SPI bus  */
#define SPI_FAULT_ENABLE_FAULT_ENABLE_0     (SPI_FAULT_ENABLE_FAULT_ENABLE_0_Val << SPI_FAULT_ENABLE_FAULT_ENABLE_Pos)  /**< (SPI_FAULT_ENABLE) Faults ignored on SPI bus Position  */
#define SPI_FAULT_ENABLE_FAULT_ENABLE_1     (SPI_FAULT_ENABLE_FAULT_ENABLE_1_Val << SPI_FAULT_ENABLE_FAULT_ENABLE_Pos)  /**< (SPI_FAULT_ENABLE) Faults detected on SPI bus Position  */
#define SPI_FAULT_ENABLE_MASK               0x01u                                          /**< \deprecated (SPI_FAULT_ENABLE) Register MASK  (Use SPI_FAULT_ENABLE_Msk instead)  */
#define SPI_FAULT_ENABLE_Msk                0x01u                                          /**< (SPI_FAULT_ENABLE) Register Mask  */

/* -------- SPI_CONFIGURATION : (SPI Offset: 0x24) (R/W 8) SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SCK_POLARITY:1;            /**< bit:      0  Selects the level of sck in Idle State   */
    uint8_t  SCK_PHASE:1;               /**< bit:      1  Selects clock edge used for data sampling and launching */
    uint8_t  LSB_FIRST_ENABLE:1;        /**< bit:      2  Selects LSB bits to be transmitted first */
    uint8_t  BIDIRECTIONAL_ENABLE:1;    /**< bit:      3  Enable Bidirectional mode of operation   */
    uint8_t  OUTPUT_ENABLE:1;           /**< bit:      4  Active High Output Enable when in Bidirectional Mode */
    uint8_t  SSN_SHIFT_ENABLE:1;        /**< bit:      5  Active High Shift Enable when SSN signal is asserted */
    uint8_t  SSN_SYNC_ENABLE:1;         /**< bit:      6  Active High SSN Signal Synchronisation Enable */
    uint8_t  RX_DONE_SYNC_ENABLE:1;     /**< bit:      7  Active High rx_done Signal Synchronisation Enable */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_CONFIGURATION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_CONFIGURATION_OFFSET            0x24                                          /**<  (SPI_CONFIGURATION) SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed.   Offset */
#define SPI_CONFIGURATION_RESETVALUE        0xE0u                                         /**<  (SPI_CONFIGURATION) SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed.   Reset Value */

#define SPI_CONFIGURATION_SCK_POLARITY_Pos  0                                              /**< (SPI_CONFIGURATION) Selects the level of sck in Idle State Position */
#define SPI_CONFIGURATION_SCK_POLARITY_Msk  (0x1u << SPI_CONFIGURATION_SCK_POLARITY_Pos)   /**< (SPI_CONFIGURATION) Selects the level of sck in Idle State Mask */
#define SPI_CONFIGURATION_SCK_POLARITY      SPI_CONFIGURATION_SCK_POLARITY_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_SCK_POLARITY_Msk instead */
#define   SPI_CONFIGURATION_SCK_POLARITY_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) SCK is Low  */
#define   SPI_CONFIGURATION_SCK_POLARITY_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) SCK is High  */
#define SPI_CONFIGURATION_SCK_POLARITY_0    (SPI_CONFIGURATION_SCK_POLARITY_0_Val << SPI_CONFIGURATION_SCK_POLARITY_Pos)  /**< (SPI_CONFIGURATION) SCK is Low Position  */
#define SPI_CONFIGURATION_SCK_POLARITY_1    (SPI_CONFIGURATION_SCK_POLARITY_1_Val << SPI_CONFIGURATION_SCK_POLARITY_Pos)  /**< (SPI_CONFIGURATION) SCK is High Position  */
#define SPI_CONFIGURATION_SCK_PHASE_Pos     1                                              /**< (SPI_CONFIGURATION) Selects clock edge used for data sampling and launching Position */
#define SPI_CONFIGURATION_SCK_PHASE_Msk     (0x1u << SPI_CONFIGURATION_SCK_PHASE_Pos)      /**< (SPI_CONFIGURATION) Selects clock edge used for data sampling and launching Mask */
#define SPI_CONFIGURATION_SCK_PHASE         SPI_CONFIGURATION_SCK_PHASE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_SCK_PHASE_Msk instead */
#define   SPI_CONFIGURATION_SCK_PHASE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) Bits are sampled on the first edge and the following bit is output on the next edge  */
#define   SPI_CONFIGURATION_SCK_PHASE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) Bits are output on the first edge and are sampled on the following edge  */
#define SPI_CONFIGURATION_SCK_PHASE_0       (SPI_CONFIGURATION_SCK_PHASE_0_Val << SPI_CONFIGURATION_SCK_PHASE_Pos)  /**< (SPI_CONFIGURATION) Bits are sampled on the first edge and the following bit is output on the next edge Position  */
#define SPI_CONFIGURATION_SCK_PHASE_1       (SPI_CONFIGURATION_SCK_PHASE_1_Val << SPI_CONFIGURATION_SCK_PHASE_Pos)  /**< (SPI_CONFIGURATION) Bits are output on the first edge and are sampled on the following edge Position  */
#define SPI_CONFIGURATION_LSB_FIRST_ENABLE_Pos 2                                              /**< (SPI_CONFIGURATION) Selects LSB bits to be transmitted first Position */
#define SPI_CONFIGURATION_LSB_FIRST_ENABLE_Msk (0x1u << SPI_CONFIGURATION_LSB_FIRST_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Selects LSB bits to be transmitted first Mask */
#define SPI_CONFIGURATION_LSB_FIRST_ENABLE  SPI_CONFIGURATION_LSB_FIRST_ENABLE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_LSB_FIRST_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_LSB_FIRST_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) Data transmitted MSB first  */
#define   SPI_CONFIGURATION_LSB_FIRST_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) Data transmitted LSB first  */
#define SPI_CONFIGURATION_LSB_FIRST_ENABLE_0 (SPI_CONFIGURATION_LSB_FIRST_ENABLE_0_Val << SPI_CONFIGURATION_LSB_FIRST_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Data transmitted MSB first Position  */
#define SPI_CONFIGURATION_LSB_FIRST_ENABLE_1 (SPI_CONFIGURATION_LSB_FIRST_ENABLE_1_Val << SPI_CONFIGURATION_LSB_FIRST_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Data transmitted LSB first Position  */
#define SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Pos 3                                              /**< (SPI_CONFIGURATION) Enable Bidirectional mode of operation Position */
#define SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Msk (0x1u << SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Enable Bidirectional mode of operation Mask */
#define SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) SPI is unidirectional, Tx and Rx each has dedicated one port  */
#define   SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) SPI is bidirectional, Tx and Rx share one input/output port (MOSI if Master, MISO if Slave)  */
#define SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_0 (SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_0_Val << SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Pos)  /**< (SPI_CONFIGURATION) SPI is unidirectional, Tx and Rx each has dedicated one port Position  */
#define SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_1 (SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_1_Val << SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE_Pos)  /**< (SPI_CONFIGURATION) SPI is bidirectional, Tx and Rx share one input/output port (MOSI if Master, MISO if Slave) Position  */
#define SPI_CONFIGURATION_OUTPUT_ENABLE_Pos 4                                              /**< (SPI_CONFIGURATION) Active High Output Enable when in Bidirectional Mode Position */
#define SPI_CONFIGURATION_OUTPUT_ENABLE_Msk (0x1u << SPI_CONFIGURATION_OUTPUT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Active High Output Enable when in Bidirectional Mode Mask */
#define SPI_CONFIGURATION_OUTPUT_ENABLE     SPI_CONFIGURATION_OUTPUT_ENABLE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_OUTPUT_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_OUTPUT_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) MISO is an input if in Slave mode. MOSI is an input if in Master mode  */
#define   SPI_CONFIGURATION_OUTPUT_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) MISO is an output if in Slave mode. MOSI is an output if in Master mode  */
#define SPI_CONFIGURATION_OUTPUT_ENABLE_0   (SPI_CONFIGURATION_OUTPUT_ENABLE_0_Val << SPI_CONFIGURATION_OUTPUT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) MISO is an input if in Slave mode. MOSI is an input if in Master mode Position  */
#define SPI_CONFIGURATION_OUTPUT_ENABLE_1   (SPI_CONFIGURATION_OUTPUT_ENABLE_1_Val << SPI_CONFIGURATION_OUTPUT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) MISO is an output if in Slave mode. MOSI is an output if in Master mode Position  */
#define SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Pos 5                                              /**< (SPI_CONFIGURATION) Active High Shift Enable when SSN signal is asserted Position */
#define SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Msk (0x1u << SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Active High Shift Enable when SSN signal is asserted Mask */
#define SPI_CONFIGURATION_SSN_SHIFT_ENABLE  SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_SSN_SHIFT_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) Shift counter is enabled only when ssn is asserted  */
#define   SPI_CONFIGURATION_SSN_SHIFT_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) Shift counter is always enabled  */
#define SPI_CONFIGURATION_SSN_SHIFT_ENABLE_0 (SPI_CONFIGURATION_SSN_SHIFT_ENABLE_0_Val << SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Shift counter is enabled only when ssn is asserted Position  */
#define SPI_CONFIGURATION_SSN_SHIFT_ENABLE_1 (SPI_CONFIGURATION_SSN_SHIFT_ENABLE_1_Val << SPI_CONFIGURATION_SSN_SHIFT_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Shift counter is always enabled Position  */
#define SPI_CONFIGURATION_SSN_SYNC_ENABLE_Pos 6                                              /**< (SPI_CONFIGURATION) Active High SSN Signal Synchronisation Enable Position */
#define SPI_CONFIGURATION_SSN_SYNC_ENABLE_Msk (0x1u << SPI_CONFIGURATION_SSN_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Active High SSN Signal Synchronisation Enable Mask */
#define SPI_CONFIGURATION_SSN_SYNC_ENABLE   SPI_CONFIGURATION_SSN_SYNC_ENABLE_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_SSN_SYNC_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_SSN_SYNC_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) SSN internal synchronisation is bypassed  */
#define   SPI_CONFIGURATION_SSN_SYNC_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) SSN is internally synchronised before being used  */
#define SPI_CONFIGURATION_SSN_SYNC_ENABLE_0 (SPI_CONFIGURATION_SSN_SYNC_ENABLE_0_Val << SPI_CONFIGURATION_SSN_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) SSN internal synchronisation is bypassed Position  */
#define SPI_CONFIGURATION_SSN_SYNC_ENABLE_1 (SPI_CONFIGURATION_SSN_SYNC_ENABLE_1_Val << SPI_CONFIGURATION_SSN_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) SSN is internally synchronised before being used Position  */
#define SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Pos 7                                              /**< (SPI_CONFIGURATION) Active High rx_done Signal Synchronisation Enable Position */
#define SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Msk (0x1u << SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) Active High rx_done Signal Synchronisation Enable Mask */
#define SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Msk instead */
#define   SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_0_Val 0x0u                                           /**< (SPI_CONFIGURATION) rx_done internal synchronisation is bypassed  */
#define   SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_1_Val 0x1u                                           /**< (SPI_CONFIGURATION) rx_done is internally synchronised before being used  */
#define SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_0 (SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_0_Val << SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) rx_done internal synchronisation is bypassed Position  */
#define SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_1 (SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_1_Val << SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE_Pos)  /**< (SPI_CONFIGURATION) rx_done is internally synchronised before being used Position  */
#define SPI_CONFIGURATION_MASK              0xFFu                                          /**< \deprecated (SPI_CONFIGURATION) Register MASK  (Use SPI_CONFIGURATION_Msk instead)  */
#define SPI_CONFIGURATION_Msk               0xFFu                                          /**< (SPI_CONFIGURATION) Register Mask  */

/* -------- SPI_BUS_STATUS : (SPI Offset: 0x28) (R/ 8) Status of SPI bus.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SPI_ACTIVE:1;              /**< bit:      0  Active High indicatation that the SPI Module is active. While set, SPI configuration should not be modified.  */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_BUS_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

