remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
#define SPI_BUS_STATUS_OFFSET               0x28                                          /**<  (SPI_BUS_STATUS) Status of SPI bus.   Offset */
#define SPI_BUS_STATUS_RESETVALUE           0x00u                                         /**<  (SPI_BUS_STATUS) Status of SPI bus.   Reset Value */

#define SPI_BUS_STATUS_SPI_ACTIVE_Pos       0                                              /**< (SPI_BUS_STATUS) Active High indicatation that the SPI Module is active. While set, SPI configuration should not be modified.  Position */
#define SPI_BUS_STATUS_SPI_ACTIVE_Msk       (0x1u << SPI_BUS_STATUS_SPI_ACTIVE_Pos)        /**< (SPI_BUS_STATUS) Active High indicatation that the SPI Module is active. While set, SPI configuration should not be modified.  Mask */
#define SPI_BUS_STATUS_SPI_ACTIVE           SPI_BUS_STATUS_SPI_ACTIVE_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_BUS_STATUS_SPI_ACTIVE_Msk instead */
#define SPI_BUS_STATUS_MASK                 0x01u                                          /**< \deprecated (SPI_BUS_STATUS) Register MASK  (Use SPI_BUS_STATUS_Msk instead)  */
#define SPI_BUS_STATUS_Msk                  0x01u                                          /**< (SPI_BUS_STATUS) Register Mask  */

/* -------- SPI_TX_INTERRUPT_MASK : (SPI Offset: 0x2c) (R/W 8) Enable or Disable the generation of interrupts by the tx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL_MASK:1;   /**< bit:      0  Active High Enable of tx_fifo_not_full interrupt  */
    uint8_t  TX_FIFO_0P25_EMPTY_MASK:1;  /**< bit:      1  Active High Enable of tx_fifo_0p25_empty interrupt  */
    uint8_t  TX_FIFO_0P5_EMPTY_MASK:1;  /**< bit:      2  Active High Enable of tx_fifo_0p5_empty interrupt  */
    uint8_t  TX_FIFO_0P75_EMPTY_MASK:1;  /**< bit:      3  Active High Enable of tx_fifo_0p75_empty interrupt  */
    uint8_t  TX_FIFO_EMPTY_MASK:1;      /**< bit:      4  Active High Enable of tx_fifo_empty interrupt  */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_TX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TX_INTERRUPT_MASK_OFFSET        0x2C                                          /**<  (SPI_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Offset */
#define SPI_TX_INTERRUPT_MASK_RESETVALUE    0x00u                                         /**<  (SPI_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Reset Value */

#define SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos 0                                              /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Position */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk (0x1u << SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos)  /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Mask */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk instead */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos 1                                              /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Position */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk (0x1u << SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos)  /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Mask */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk instead */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos 2                                              /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Position */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk (0x1u << SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos)  /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Mask */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk instead */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos 3                                              /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Position */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk (0x1u << SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos)  /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Mask */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk instead */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos 4                                              /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Position */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk (0x1u << SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos)  /**< (SPI_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Mask */
#define SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk instead */
#define SPI_TX_INTERRUPT_MASK_Msk           0x1Fu                                          /**< (SPI_TX_INTERRUPT_MASK) Register Mask  */

