remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
/* -------- SPI_RX_INTERRUPT_MASK : (SPI Offset: 0x30) (R/W 8) Enable or Disable the generation of interrupts by the rx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY_MASK:1;  /**< bit:      0  Active High Enable of rx_fifo_not_empty interrupt  */
    uint8_t  RX_FIFO_0P25_FULL_MASK:1;  /**< bit:      1  Active High Enable of rx_fifo_0p25_full interrupt  */
    uint8_t  RX_FIFO_0P5_FULL_MASK:1;   /**< bit:      2  Active High Enable of rx_fifo_0p5_full interrupt  */
    uint8_t  RX_FIFO_0P75_FULL_MASK:1;  /**< bit:      3  Active High Enable of rx_fifo_0p75_full interrupt  */
    uint8_t  FAULT_DETECT_MASK:1;       /**< bit:      4  Active High Enable of fault detection interrupt  */
    uint8_t  FIFO_OVERRUN_MASK:1;       /**< bit:      5  Active High Enable of FIFO overrun interrupt  */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_RX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RX_INTERRUPT_MASK_OFFSET        0x30                                          /**<  (SPI_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Offset */
#define SPI_RX_INTERRUPT_MASK_RESETVALUE    0x00u                                         /**<  (SPI_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Reset Value */

#define SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos 0                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos 1                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos 2                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos 3                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK_Pos 4                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of fault detection interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of fault detection interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_FAULT_DETECT_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos 5                                              /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Position */
#define SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk (0x1u << SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos)  /**< (SPI_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Mask */
#define SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk instead */
#define SPI_RX_INTERRUPT_MASK_Msk           0x3Fu                                          /**< (SPI_RX_INTERRUPT_MASK) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief SPI hardware registers */
typedef struct {  /* SPI Master/Slave Controller */
  WoReg8  TRANSMIT_DATA;  /**< (SPI Offset: 0x00) Writes one byte to SPI Transmit Data FIFO.  */
  __I  uint8_t  Reserved1[3];
  RoReg8  RECEIVE_DATA;   /**< (SPI Offset: 0x04) Read one byte from SPI Receive Data FIFO.  */
  __I  uint8_t  Reserved2[3];
  RoReg8  TRANSMIT_STATUS; /**< (SPI Offset: 0x08) Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
  __I  uint8_t  Reserved3[3];
  RoReg8  RECEIVE_STATUS; /**< (SPI Offset: 0x0C) Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
  __I  uint8_t  Reserved4[3];
  RwReg8  CLOCK_SOURCE_SELECT; /**< (SPI Offset: 0x10) Clock Source Select */
  __I  uint8_t  Reserved5[3];
  RwReg16 SPI_CLK_DIVIDER; /**< (SPI Offset: 0x14) Register sets the divide ratio used to generate the sck clock from the module's input clock.  */
  __I  uint8_t  Reserved6[2];
  RwReg8  SPI_MODULE_ENABLE; /**< (SPI Offset: 0x18) SPI Enable */
  __I  uint8_t  Reserved7[3];
  RwReg8  SPI_MASTER_MODE; /**< (SPI Offset: 0x1C) SPI Master/Slave Mode. When clear, SPI is in Slave Mode.  */
  __I  uint8_t  Reserved8[3];
  RwReg8  SPI_FAULT_ENABLE; /**< (SPI Offset: 0x20) SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.   */
  __I  uint8_t  Reserved9[3];
  RwReg8  SPI_CONFIGURATION; /**< (SPI Offset: 0x24) SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed.  */
  __I  uint8_t  Reserved10[3];
  RoReg8  SPI_BUS_STATUS; /**< (SPI Offset: 0x28) Status of SPI bus.  */
  __I  uint8_t  Reserved11[3];
  RwReg8  TX_INTERRUPT_MASK; /**< (SPI Offset: 0x2C) Enable or Disable the generation of interrupts by the tx_status register.  */
  __I  uint8_t  Reserved12[3];
  RwReg8  RX_INTERRUPT_MASK; /**< (SPI Offset: 0x30) Enable or Disable the generation of interrupts by the rx_status register.  */
} Spi;

