remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief SPI hardware registers */
typedef struct {  /* SPI Master/Slave Controller */
  __O  SPI_TRANSMIT_DATA_Type         TRANSMIT_DATA;  /**< Offset: 0x00 ( /W   8) Writes one byte to SPI Transmit Data FIFO.  */
       RoReg8                         Reserved1[0x3];
  __I  SPI_RECEIVE_DATA_Type          RECEIVE_DATA;   /**< Offset: 0x04 (R/    8) Read one byte from SPI Receive Data FIFO.  */
       RoReg8                         Reserved2[0x3];
  __I  SPI_TRANSMIT_STATUS_Type       TRANSMIT_STATUS; /**< Offset: 0x08 (R/    8) Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
       RoReg8                         Reserved3[0x3];
  __I  SPI_RECEIVE_STATUS_Type        RECEIVE_STATUS; /**< Offset: 0x0C (R/    8) Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
       RoReg8                         Reserved4[0x3];
  __IO SPI_CLOCK_SOURCE_SELECT_Type   CLOCK_SOURCE_SELECT; /**< Offset: 0x10 (R/W   8) Clock Source Select */
       RoReg8                         Reserved5[0x3];
  __IO SPI_CLK_DIVIDER_Type           SPI_CLK_DIVIDER; /**< Offset: 0x14 (R/W  16) Register sets the divide ratio used to generate the sck clock from the module's input clock.  */
       RoReg8                         Reserved6[0x2];
  __IO SPI_MODULE_ENABLE_Type         SPI_MODULE_ENABLE; /**< Offset: 0x18 (R/W   8) SPI Enable */
       RoReg8                         Reserved7[0x3];
  __IO SPI_MASTER_MODE_Type           SPI_MASTER_MODE; /**< Offset: 0x1C (R/W   8) SPI Master/Slave Mode. When clear, SPI is in Slave Mode.  */
       RoReg8                         Reserved8[0x3];
  __IO SPI_FAULT_ENABLE_Type          SPI_FAULT_ENABLE; /**< Offset: 0x20 (R/W   8) SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.   */
       RoReg8                         Reserved9[0x3];
  __IO SPI_CONFIGURATION_Type         SPI_CONFIGURATION; /**< Offset: 0x24 (R/W   8) SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed.  */
       RoReg8                         Reserved10[0x3];
  __I  SPI_BUS_STATUS_Type            SPI_BUS_STATUS; /**< Offset: 0x28 (R/    8) Status of SPI bus.  */
       RoReg8                         Reserved11[0x3];
  __IO SPI_TX_INTERRUPT_MASK_Type     TX_INTERRUPT_MASK; /**< Offset: 0x2C (R/W   8) Enable or Disable the generation of interrupts by the tx_status register.  */
       RoReg8                         Reserved12[0x3];
  __IO SPI_RX_INTERRUPT_MASK_Type     RX_INTERRUPT_MASK; /**< Offset: 0x30 (R/W   8) Enable or Disable the generation of interrupts by the rx_status register.  */
} Spi;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_SPI_COMPONENT_ */
